Catalogs/ОперацииБанкКасса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ОперацииБанкКасса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийППИ</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОперацииБанкКасса/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	ВыбранныйЭлемент = Элементы.Список.ТекущиеДанные;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда	
		СтруктураДанных = Новый Структура();
		СтруктураДанных.Вставить("Операции", Истина);	
		СтруктураДанных.Вставить("КорСчет", ВыбранныйЭлемент.КорСчет);
		СтруктураДанных.Вставить("ВидОперации", ВыбранныйЭлемент.ВидОперации);
		
		Если ВыбранныйЭлемент.ВидДокумента = "РКО" Тогда
			ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента", СтруктураДанных);
		Иначе
			ОткрытьФорму("Документ.ПлатежноеПоручениеИсходящее.Форма.ФормаДокумента", СтруктураДанных);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
